; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	infrared1 - mode
	thermograph3 - mode
	thermograph4 - mode
	thermograph2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation4 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(have_image Planet11 thermograph3)
	(have_image Star12 thermograph3)
	(have_image Star13 thermograph4)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 thermograph2)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet16 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet16)
   goals met: 0 of 7
5. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 1 of 7
6. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 1 of 7
7. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 2 of 7
8. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 7
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
10. (turn_to satellite0 groundstation2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 7
11. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 7
12. (turn_to satellite0 planet11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
13. (take_image satellite0 planet11 instrument1 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 3 of 7
14. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
15. (take_image satellite0 star12 instrument1 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 4 of 7
16. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
17. (take_image satellite0 star13 instrument1 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 5 of 7
18. (turn_to satellite0 phenomenon14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 7
19. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 7 of 7
